// ДЗ 4.1. Вгадай результат

// 1. 'number' + 3 + 3
// Стрінг плюс число  = стрінг (текст)
console.log('number' + 3 + 3); 
// результат = number33

// 2. null + 3
// null це 0 
// тобто 0 + 3 = 3
console.log(null + 3); 
// результат  = 3

// 3. 5 && "qwerty"
// 5- це число, а числа вважаються true.
// Оператор && повертає другий операнд, якщо перший true
console.log(5 && "qwerty"); 
// результат "qwerty"

// 4. +'40' + +'2' + "hillel"
// +'40' = 40 -унарний плюс перетворює стрінг в число
// +'2' = 2 -унарний плюс перетворює стрінг в число
// 42 + "hillel" = "42hillel" (число + текст = текст)
console.log(+'40' + +'2' + "hillel"); 
// результат "42hillel"

// 5. '10' - 5 === 6
// '10' - 5 = 5 (стрінг '10' перетворюється в число 10, бо оператор мінус)
// 5 === 6 це false
console.log('10' - 5 === 6);
// false

// 6. true + false
// true це 1, а false = 0
// 1 + 0 = 1
console.log(true + false); 
// результат 1

// 7. '4px' - 3
// 4px не може бути перетворено в число, тому результат NaN
console.log('4px' - 3);
 // результат NaN

// 8. '4' - 3
// '4' це просто число 4 в цьому прикладі, бо оператор мінус
console.log('4' - 3); 
// результат 1

// 9. '6' + 3 ** 0
// 3 ** 0 = 1 (число в нульовому степені = 1)
// '6' + 1 = стрінг 61 
console.log('6' + 3 ** 0); 
// стрінг 61

// 10. 12 / '6'
// '6' це число 6, 12 / 6 = 2
console.log(12 / '6'); 
// 2

// 11. '10' + (5 === 6)
// спочатку у дужках 5 === 6 це false, '10' + false = '10false' (стрінг + boolean = стрінг)
console.log('10' + (5 === 6)); 
// Результат "10false"

// 12. null == ''
// null можна порівняти == тільки з undefined
console.log(null == ''); 
// Буде false

// 13. 3 ** (9 / 3)
// спочатку у дужках 9 / 3 = 3
// 3 ** 3= 27 (ступінь)
console.log(3 ** (9 / 3)); 
//Буде 27

// 14. !!'false' == !!'true'
// 'false' і 'true' - це не пусті стрінги, а значить вони true
// !!'false' == !!'true' -> true == true -> true
console.log(!!'false' == !!'true'); 
// Тобто true

// 15. 0 || '0' && 1
// Оператор && має більший пріоритет, тому спочатку '0' && 1 = 1 
// '0' — це непуста стрічка, тобто true
// 1 —теж true
// Оператор && повертає другий операнд, якщо перший true, '0' && 1 = 1
// Залишається 0 || 1, де 0 це false, 1 - true)
console.log(0 || '0' && 1); 
// Виходить 1, бо оператор || повертає перший true операнд

// 16. (+null == false) < 1;
// +null = 0(унарний плюс перетворює null на 0), false = 0 (у числовому контексті)
// 0 == 0 це true
//  true у числовому порівнянні стає 1, Тобто 1 < 1 
console.log((+null == false) < 1); 
//  false

// 17. false && true || true
// false && true = false - оператор повертає перший false операнд
// false || true = true - оператор повертає перший true операнд
console.log(false && true || true); 
// Результат true

// 18. false && (false || true);
// спочатку вираз у дужках false || true = true
//  оператор "||" (логічне АБО) повертає перший true операнд.
// false && true = false
// оператор && повертає перший false операнд.
console.log(false && (false || true)); 
//Результат false

// 19. (+null == false) < 1 ** 5;
// +null = 0 (унарний плюс перетворює null на 0) , false = 0 (у числовому контексті)
// 0 == 0 це true
// 1 ** 5 = 1 (ступінь)
// true у числовому порівнянні стає 1
// 1 < 1 це false
console.log((+null == false) < 1 ** 5); 
// Результат false